tutorials/lagrangian/trackedReactingParcelFoam/filter/constant/parcelInjectionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      scalarListList;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// x y z u v w d rho mDot T cp Y0..YN
(
    (0.1 0.3 0.0 2.0 0.0 0.0 0.001 1000 0.2 300 4200 1.0)
    (0.1 0.4 0.0 2.0 0.0 0.0 0.001 1000 0.2 300 4200 1.0)
    (0.1 0.5 0.0 2.0 0.0 0.0 0.001 1000 0.2 300 4200 1.0)
    (0.1 0.6 0.0 2.0 0.0 0.0 0.001 1000 0.2 300 4200 1.0)
    (0.1 0.7 0.0 2.0 0.0 0.0 0.001 1000 0.2 300 4200 1.0)
);


// ************************************************************************* //
