tutorials/lagrangian/trackedReactingParcelFoam/filter/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType      hMixtureThermo<reactingMixture>;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/chemkin/foam.inp";

foamChemistryThermoFile "$FOAM_CASE/chemkin/foam.dat";

liquidComponents ( H2O );

solidFuelComponents ( );

inertSpecie     N2;

H2O             H2O defaultCoeffs;


// ************************************************************************* //
