tutorials/lagrangian/trackedReactingParcelFoam/filter/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1.0;
        value           uniform 0;
    }

    inlet
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1.0;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }

    cycLeft
    {
        type            cyclic;
    }

    cycRight
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
