tutorials/lagrangian/trackedReactingParcelFoam/filter/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 9.38e-04;

boundaryField
{
    walls
    {
        type            compressible::kQRWallFunction;
        value           uniform 9.38e-04;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 9.38e-04;
    }

    outlet
    {
        type            zeroGradient;
    }

    cycLeft
    {
        type            cyclic;
    }

    cycRight
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
